Revit 2026 API
BeamSystem.Create Method
Overload List
Name | Description
Create(Document, IList<Curve>, SketchPlane, Int32)
Create(Document, IList<Curve>, Level, XYZ, Boolean)
Create(Document, IList<Curve>, Level, Int32, Boolean)
Create(Document, IList<Curve>, SketchPlane, XYZ, Boolean)
Top
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace